Revit 2026 API

# DocumentVersion Methods

---

The DocumentVersion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Checks whether two DocumentVersions are identical. They are identical if both the GUID and number of saves are equal. If two DocumentVersions are identical, they come from the same document, with the same set of changes. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DocumentVersion Class

Autodesk.Revit.DB Namespace